In [7]:
my_dictionary={
    "name":["violet","mark","Laura","tonny"],
    "age":[26,30,47,50],
    "salary":[30000,35000,40000,45000],
    "target":[3,4,5,6],
}

In [8]:
print(my_dictionary)

{'name': ['violet', 'mark', 'Laura', 'tonny'], 'age': [26, 30, 47, 50], 'salary': [30000, 35000, 40000, 45000], 'target': [3, 4, 5, 6]}

In [10]:
for key, value in my_dictionary.items():
    print(key, value)

name ['violet', 'mark', 'Laura', 'tonny']
age [26, 30, 47, 50]
salary [30000, 35000, 40000, 45000]
target [3, 4, 5, 6]

In [9]:
import pandas as pd

In [22]:
my_dictionary={
    "name":["violet","mark","laura","tonny"],
    "age":[26,30,47,50],
    "salary":[30000,35000,40000,45000],
    "target":[3,4,5,6],
}

In [23]:
my_dictionary

{'name': ['violet', 'mark', 'laura', 'tonny'],
 'age': [26, 30, 47, 50],
 'salary': [30000, 35000, 40000, 45000],
 'target': [3, 4, 5, 6]}

In [24]:
df = pd.DataFrame(my_dictionary)

In [25]:
df

     name  age  salary  target
0  violet   26   30000       3
1    mark   30   35000       4
2   laura   47   40000       5
3   tonny   50   45000       6

In [26]:
df["target"],df["salary"]=df["target"]+1,df["salary"]+1000

In [27]:
df

     name  age  salary  target
0  violet   26   31000       4
1    mark   30   36000       5
2   laura   47   41000       6
3   tonny   50   46000       7